Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
	if((p_rtc.year<19)||(p_rtc.month>12)||(p_rtc.date>31)||(p_rtc.hour>23)||(p_rtc.minute>59)||(p_rtc.second>59))
		result=0;	// bad
	else
		result=1;	// good
		
	return result;
}

/*
uint32_t findAddress(uint16_t index, uint16_t recsPerDay)
{
	uint32_t addr;
	addr = SURVEY_BASE_ADDRESS + (index/recsPerDay)*SURVEY_PTR_INC;	// got the page address
	addr += (index%recsPerDay)*sizeof(surveydata_t);
	return addr;
}
*/		
void find_num_between_lp_entries(date_time_t* from_date_time, date_time_t* to_date_time, uint32_t* range_start_entry, uint32_t* range_end_entry)
{
	date_time_t record_date_time;
	ext_rtc_t record_rtc_time;
	timeinfo_t shortTime;
	
	uint32_t addr;
	int16_t search_index, initial_search_index;
	
	int8_t match_result,loop_count,done;
	
//To find the index of the entry which matches the start time, start from the oldest record
//The ctldata.survey_wrt_ptr always points to the oldest record, if there is overflow
//If there is no overflow, then the oldest record index is 0

	uint16_t no_of_records_per_day =	1440/Common_Data.survey_interval;

	if(g_Class07_Blockload_EntriesInUse==NO_OF_SURVEY_RECORDS)
	{// here we have an overflow condition
		search_index = (ctldata.survey_wrt_ptr - (int32_t)SURVEY_BASE_ADDRESS)/(int32_t)SURVEY_PTR_INC;	// oldest record
	}
	else
		search_index=0;	// oldest record
		
		
	initial_search_index=search_index;
	
// Search in the increasing time direction	
//	addr=(int32_t)SURVEY_BASE_ADDRESS + (int32_t)search_index*(int32_t)sizeof(surveydata_t);
	addr=(int32_t)SURVEY_BASE_ADDRESS + (int32_t)search_index*(int32_t)SURVEY_PTR_INC;

	match_result = 0;
	loop_count=0;	// keeps count of number of days
	done=0;
	
	do
	{
//		EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
		EPR_Read(addr, (uint8_t*)&shortTime, sizeof(timeinfo_t));	// we will get 8 bytes
		ConvertShortDate_RTC(&record_rtc_time,&shortTime);
		ConvertRTCDate(&record_date_time,&record_rtc_time);
		record_date_time.second = 0xff;
		record_date_time.hundredths = 0xff;
	
// compare 	record_date_time with from_date_time
		match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
		loop_count++;
		
		if(match_result>=0)
			done=1;	// record_date_time >= from_date_time
		else
		{
			search_index+=no_of_records_per_day;	// increase the search index by 96/48/24
			if((search_index-initial_search_index)>g_Class07_Blockload_EntriesInUse)
				search_index = initial_search_index + g_Class07_Blockload_EntriesInUse;
			addr=(int32_t)SURVEY_BASE_ADDRESS + (int32_t)(search_index%NO_OF_SURVEY_RECORDS)*(int32_t)SURVEY_PTR_INC;
			
		}
	}
	while ((done==0)&&(loop_count<NO_OF_DAYS_SURVEY_DATA));
	
// we will exit the loop if we have either found or crossed the from_date_time
// we will also exit the loop if we have searched all the data

	if((done==0)&&(loop_count==NO_OF_DAYS_SURVEY_DATA))
	{// no record was found with date_time >= from_date_time
		*range_start_entry=1;
		*range_end_entry=1;
		return;
	}

// here the done==1 and loop_count<NO_OF_DAYS_SURVEY_DATA

//	if(match_result>=0)
	if(match_result==0)
	{
		*range_start_entry=search_index+1;
	}
	else
	{// here match_result is > 0 - we have overshot - hence the actual record is in the past
	// search the past no_of_records_per_day by going back - this time search ends if match==0 or match <0
	// addr already points to the record whose datetime is > from_date_time
	// search_index is the index of that record
	
		loop_count=0;
		done=0;
		
		do
		{
			if(search_index==initial_search_index)
				done=1;	// no need to check any further - we have already reached the first record
			else
			{
			  decptr_maskless(&addr, SURVEY_BASE_ADDRESS, SURVEY_END_ADDRESS, SURVEY_PTR_INC);
				search_index--;	// do we need to check for this value becoming -ve

//				EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
				EPR_Read(addr, (uint8_t*)&shortTime, sizeof(timeinfo_t));	// we will get 8 bytes
				ConvertShortDate_RTC(&record_rtc_time,&shortTime);
				ConvertRTCDate(&record_date_time,&record_rtc_time);
				record_date_time.second = 0xff;
				record_date_time.hundredths = 0xff;
		
	// compare 	record_date_time with from_date_time
				match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
			
				loop_count++;
			
				if(match_result<=0)
					done=1;	// record_date_time >= from_date_time
			}
		}
		while (done==0);
		
		// when we come out of the loop we would have the desired record	
		*range_start_entry=search_index+1;
	}

// we now have the range_start_entry - now to find the range_end_entry
// start from search_index and increase in steps of no_of_records_per_day till match_result>=0 or loop_count==NO_OF_DAYS_SURVEY_DATA 
// in either case we have the range_end_entry

	loop_count=0;
	done=0;

	search_index+=no_of_records_per_day;	// increase the search index by 96/48/24
	if((search_index-initial_search_index)>g_Class07_Blockload_EntriesInUse)
		search_index = initial_search_index + g_Class07_Blockload_EntriesInUse;
	addr=(int32_t)SURVEY_BASE_ADDRESS + (int32_t)(search_index%NO_OF_SURVEY_RECORDS)*(int32_t)SURVEY_PTR_INC;
	
	do
	{
//		EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
		EPR_Read(addr, (uint8_t*)&shortTime, sizeof(timeinfo_t));	// we will get 8 bytes
		ConvertShortDate_RTC(&record_rtc_time,&shortTime);
		ConvertRTCDate(&record_date_time,&record_rtc_time);
		record_date_time.second = 0xff;
		record_date_time.hundredths = 0xff;
	
// compare 	record_date_time with from_date_time
		match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)to_date_time);
		
		loop_count++;
		
		if(match_result>=0)
			done=1;	// record_date_time >= from_date_time
		else
		{
			search_index+=no_of_records_per_day;	// increase the search index by 96/48/24
			if((search_index-initial_search_index)>g_Class07_Blockload_EntriesInUse)
				search_index = initial_search_index + g_Class07_Blockload_EntriesInUse;
			addr=(int32_t)SURVEY_BASE_ADDRESS + (int32_t)(search_index%NO_OF_SURVEY_RECORDS)*(int32_t)SURVEY_PTR_INC;
		}
	}
	while ((done==0)&&(loop_count<NO_OF_DAYS_SURVEY_DATA));

// we come out of the loop when record time matches or crosses the to_date_time	
	
	if(match_result==0)
		*range_end_entry = search_index+1;	// we have a match
	else
	{// we have overshot - keep going back till entry is found or match_result becomes -ve
	
		loop_count=0;
		done=0;
		
		do
		{
			if(search_index==initial_search_index)
				done=1;	// no need to check any further - we have already reached the first record
			else
			{
			  decptr_maskless(&addr, SURVEY_BASE_ADDRESS, SURVEY_END_ADDRESS, SURVEY_PTR_INC);
				search_index--;	// do we need to check for this value becoming -ve
//				EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
				EPR_Read(addr, (uint8_t*)&shortTime, sizeof(timeinfo_t));	// we will get 8 bytes
				ConvertShortDate_RTC(&record_rtc_time,&shortTime);
				ConvertRTCDate(&record_date_time,&record_rtc_time);
				record_date_time.second = 0xff;
				record_date_time.hundredths = 0xff;
		
	// compare 	record_date_time with from_date_time
				match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)to_date_time);
				
				loop_count++;
				
				if(match_result<=0)
					done=1;	// record_date_time >= from_date_time
			}
		}
//		while ((done==0)&&(loop_count<no_of_records_per_day));
		while (done==0);
	
		*range_end_entry = search_index+1;
	}
}

void find_num_between_dlp_entries(date_time_t* from_date_time, date_time_t* to_date_time, uint32_t* range_start_entry, uint32_t* range_end_entry)
{
	date_time_t record_date_time;
	ext_rtc_t record_rtc_time;

