Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
		// Method 1 - execute (data)?  
		if (method_id == 1)
		{
			// Do nothing  
			u16_data = ((Unsigned16)*(p_data + 1) << 8) | *(p_data + 2);
			for (u8_data = 0; u8_data < p_child_record->nr_scripts; u8_data ++)
			{
				script_t *check_script = (script_t *)(p_child_record->p_scripts + u8_data);

				if(u16_data == check_script->script_id)
				{
					//Execute script 
					if(R_OBIS_Class09_ScriptExecute(p_child_record->logical_name, u16_data))
					{
						response_result = ACTION_RESULT_SUCCESS;
					}
					break;
				}
				// Ensure no reset  
				R_USER_WDT_Restart();
			}
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_15) && USED_CLASS_15 == 1)
	else if (class_id == 15)
	{
		class15_child_record_t	*p_child_record;

		// Get the child record  
		p_child_record = (class15_child_record_t *)(
		R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);
	
		// Method 1 - reply_to_HLS_authentication (data)?  
		if (method_id == 1)
		{
//			 * TODO: put the custom verification method here, using
//			 * + secret method = p_child_record->mechanism_id (MD5, SHA-1, GMAC, etc ?)
//			 * + shared key    = p_child_record->p_shared_key
//			 * + StoC          = p_child_record->p_secret_key
//			 * + CtoS          = COSEMOpenGetHLSCtoS()
//			 * + f(StoC)       = p_data +2
//			 * + f(CtoS)       = p_out_buf
			switch (child_id)
			{
				// do the same for all associations  
				default:
				{
					Unsigned16	i;					// counter  

					Unsigned8	*p_client_fStoC;	// f(StoC) received from client  
					Unsigned8	*p_client_CtoS;		// CtoS received from client  
					Unsigned8	key[64];			// store challenge | shared key used to hash  
					Unsigned16	length = 0;			// Actual length on the key  
#if (MD5_ENABLE || SHA1_ENABLE)
					Unsigned8	hash_value[20];		// 160-bits hash result  
					// Init hash_value all 0  
					memset(hash_value, 0, 20);
#endif

					// check settings on g_ChildClass15[] & client data  
					if (p_child_record->p_authen_status == NULL ||
						p_child_record->p_secret_key == NULL ||
						b_have_client_data == 0)
					{
						// failure  
						response_result = ACTION_RESULT_SCOPE_ACCESS_VIOLATED;
						break;
					}
					
//					 * Default the authentication status is failure,
//					 * will be update to success if all verification OK
					response_result = ACTION_RESULT_SCOPE_ACCESS_VIOLATED;
					*p_child_record->p_authen_status = AUTHEN_STATUS_FAILURE;

					// Restore secret  
					{
						Unsigned16	len = strlen((void *)p_child_record->p_secret_key);
						R_USER_Class15_Secret_Restore(p_child_record->p_secret_key,
												len,
												p_child_record->mechanism_id
												);
					}

					// Use a custom secret method?  
					if (p_child_record->mechanism_id == MECHANISM_ID2_HIGH_SECURITY)
					{
//						 * TODO: put the custom verification method here
//						 * Following example:
//						 *        + use ECB encode for challenge with encypt key is shared key
//						 *        + Max size is key[64]
#if AES_ENABLE
						// Calculate f(StoC)  
						length = R_OBIS_Aes_Ecbenc(p_child_record->p_shared_key, key, p_child_record->p_secret_key);

						// Check client is authenticated or not: compare with f(StoC) from client  
						if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
							*(p_data+1) != (Unsigned8)length)
						{
							// not match, break as failure  
							break;
						}
						p_client_fStoC = p_data + 2;
						for (i = 0; i < length; i++, p_client_fStoC++)
						{
							if (key[i] != *p_client_fStoC)
							{
								break;
							}
						}
						if (i < length)
						{
							// not match, break as failure  
							break;
						}

						// Client is authenticated, processes f(CtoS) send to client  
						*(p_out_buf+0) = ATTR_TYPE_OCTET_STRING;
						p_client_CtoS = COSEMOpenGetHLSCtoS();

						length = R_OBIS_Aes_Ecbenc(p_client_CtoS, (p_out_buf + 2), p_child_record->p_secret_key);
						*(p_out_buf+1) = (Unsigned8)length;
						*p_out_len = length + 2;

						// Success  
						*p_child_record->p_authen_status = AUTHEN_STATUS_SUCCESS;
						response_result = ACTION_RESULT_SUCCESS;
#endif 					
					}
					
#if MD5_ENABLE
					// Use MD5?  
					else if (p_child_record->mechanism_id == MECHANISM_ID3_HIGH_SECURITY_MD5)
					{
						// Create the f(StoC) again  
						i = strlen((void *)p_child_record->p_shared_key);
						memcpy(key, p_child_record->p_shared_key, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						R_Md5_HashDigest(
							key,
							hash_value,
							length
						);
						
						// Verify own f(StoC) with the one that send from client  
						if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
							*(p_data+1) != 16)
						{
							// MD5 not match, break as failure  
							break;
						}

						p_client_fStoC = p_data + 2;				
						for (i = 0; i < 16; i++, p_client_fStoC++)
						{
							if (hash_value[i] != *p_client_fStoC)
							{
								break;
							}
						}
						if (i < 16)
						{
							// MD5 not match, break as failure  
							break;
						}
						
//						 * If reached here: means verify OK, then make the f(CtoS) and
//						 * send back to client
						*p_out_buf++ = ATTR_TYPE_OCTET_STRING;
						*p_out_buf++ = 16;
						*p_out_len   = 18;
						
						// Make f(CtoS) (16 bytes) then store to p_out_buf  
						p_client_CtoS = COSEMOpenGetHLSCtoS();
						i = strlen((void *)p_client_CtoS);
						memcpy(key, p_client_CtoS, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						R_Md5_HashDigest(
							key,
							p_out_buf,
							length
						);

						// Success  
						*p_child_record->p_authen_status = AUTHEN_STATUS_SUCCESS;
						response_result = ACTION_RESULT_SUCCESS;
					}
#endif

#if SHA1_ENABLE
					// Use SHA-1?  
					else if (p_child_record->mechanism_id == MECHANISM_ID4_HIGH_SECURITY_SHA1)
					{
						R_sha1	work;	// work area of SHA1  

						// Create the f(StoC) again  
						i = strlen((void *)p_child_record->p_shared_key);
						memcpy(key, p_child_record->p_shared_key, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						memset((void *)&work, 0, sizeof(R_sha1));
						if (R_Sha1_HashDigest(
								key,
								hash_value,
								length,
								(R_SHA_INIT | R_SHA_FINISH),
								&work) != R_PROCESS_COMPLETE)
						{
							// SHA-1 hash failure  
							break;
						}
						
						// Verify own f(StoC) with the one that send from client  
						if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
							*(p_data+1) != 20)
						{
							// SHA-1 not match  
							break;
						}

