Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
						p_client_fStoC = p_data + 2;				
						for (i = 0; i < 20; i++, p_client_fStoC++)
						{
							if (hash_value[i] != *p_client_fStoC)
							{
								break;
							}
						}
						if (i < 20)
						{
							// SHA-1 not match  
							break;
						}
						
//						 * If reached here: means verify OK, then make the f(CtoS) and
//						 * send back to client
						*p_out_buf++ = ATTR_TYPE_OCTET_STRING;
						*p_out_buf++ = 20;
						*p_out_len   = 22;
						
						// Make f(CtoS) (20 bytes) then store to p_out_buf  
						p_client_CtoS = COSEMOpenGetHLSCtoS();
						i = strlen((void *)p_client_CtoS);
						memcpy(key, p_client_CtoS, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						memset((void *)&work, 0, sizeof(R_sha1));
						if (R_Sha1_HashDigest(
								key,
								p_out_buf,
								length,
								(R_SHA_INIT | R_SHA_FINISH),
								&work) != R_PROCESS_COMPLETE)
						{
							// SHA-1 hash failure  
							break;
						}
						
						// Success  
						*p_child_record->p_authen_status = AUTHEN_STATUS_SUCCESS;
						response_result = ACTION_RESULT_SUCCESS;
					}
#endif
					// Use GMAC?  
					else if (p_child_record->mechanism_id == MECHANISM_ID5_HIGH_SECURITY_GMAC)
					{
//						 * GMAC verification is supported on global_key_transfer method
//						 * of security_setup_ref, not here
					}
					else
					{
						// do nothing, use default status as failure  
					}
				}
				
				break;
			}
		}
		// Method 2 - change_HLS_secret (data)?  
		else if (method_id == 2)
		{
			Unsigned8	*p_client_secret = NULL;	// secret received from client  
			// Actual length on the key  
			Unsigned8	length = (Unsigned8)strlen((void *)p_child_record->p_secret_key);

			// Check client data format  
			if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
				*(p_data+1) != (Unsigned8)length)
			{
				// not match, break as failure  
				return (response_result);
			}
			// Point to secret  
			p_client_secret = p_data + 2;

			memcpy(p_child_record->p_secret_key, p_client_secret, length);
			// Backup secret  
			u8_data = R_USER_Class15_Secret_Backup(p_child_record->p_secret_key,
										(Unsigned8)length,
										p_child_record->mechanism_id
										);
			if (u8_data != 0)
			{
				return response_result;
			}

			response_result = ACTION_RESULT_SUCCESS;
		}
		// Method 3 - add_object (data)?  
		else if (method_id == 3)
		{
			// Do nothing  
		}
		// Method 4 - remove_object (data)?  
		else if (method_id == 4)
		{
			// Do nothing  
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_18) && USED_CLASS_18 == 1)
//	 * Handle all requests for class 18
//	 * Just do on following actions only:
//	 * 1. image_transfer_initiate (data)
//	 * 2. image_block_transfer (data)
//	 * 3. image_verify (data)
//	 * 4. image_activate (data)
	else if (class_id == 18)
	{
		// TODO: support these methods  
		response_result = ACTION_RESULT_RD_WRT_DENIED;
	}
#endif
#if (defined(USED_CLASS_20) && USED_CLASS_20 == 1)
//	 * Handle all requests for class 20
//	 * Just do on following actions only:
//	 * 1. activate_passive_calendar (data)
	else if (class_id == 20)
	{
		// Method 1 - activate_passive_calendar (data)?  
		if (method_id == 1)
		{
			R_USER_WDT_Restart();
			
			record_transaction_event(ACTIVITY_CALENDAR_TRANSACTION_MASK);	// in this function rtc is read
			Common_Data.pgm_count++;
			
// the following two lines are not required as generate_bill saves Common_Data
//			e2write_flags|=E2_W_IMPDATA;
//			wre2rom(); // write the tamper here itself			
			generate_bill(rtc.date, rtc.month, rtc.year, rtc.hour, rtc.minute, rtc.second, BT_TRANS);
			u8_data = R_OBIS_Class20_Activate_PassiveCalendar(child_id);
			
			write_active_tod();
			if(u8_data == 0)
			{
				response_result = ACTION_RESULT_SUCCESS;
			}
		}
	}
#endif
#if (defined(USED_CLASS_70) && USED_CLASS_70 == 1)
//	 * Handle all requests for class 70
//	 * Just do on following actions only:
//	 * 1. remote_disconnect (data)
//	 * 2. remote_reconnect (data)
	else if (class_id == 70)
	{
		//switch(method_id)
		//{
		//	case 1: break;
		//	case 2: break;
		//}
		//Set_PP(method_id,38);
		// TODO: support these methods  
		response_result = ACTION_RESULT_SUCCESS;
	}
#endif
	else
	{
		return ACTION_RESULT_TYPE_UNMATCH;
	}
	
	return (response_result);
}


//int32_t gResult;

Unsigned8 R_OBIS_GetObjectAttr(
	st_Cosem_Attr_Desc *cosem_attr_desc,
	service_type_t service_type,
	Unsigned16 child_id,
	Unsigned8  *p_out_buf,
	Unsigned16 *p_out_len,
	Unsigned8 *block_transfer,
	Unsigned8 *p_data
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;

	// Vars used to handle processing  
	Unsigned16 class_id;
	Unsigned16 attr_id;

	// Vars used to encode data  
	void        *pbuffer;
	Integer16   size;
	Unsigned8	u8_data;
	Unsigned16  u16_data;
	Unsigned32  u32_data;
	Integer32   f32_data;
	attr_type_t type;

	// Params check  
	if (cosem_attr_desc == NULL ||
		p_out_buf == NULL ||
		p_out_len == NULL ||
		block_transfer == NULL)
	{
		return TYPE_UNMATCH;
	}

	// Get information from attr descriptor  
	class_id = (
		((Unsigned16)cosem_attr_desc->Class_ID[0] << 8) |
		((Unsigned16)cosem_attr_desc->Class_ID[1])
	);
	attr_id = cosem_attr_desc->Attr_ID;

//	 * Default, marked to response to object layer that not use block transfer
//	 * Change this value to 1 at relative class processing (in below) to inform to
//	 * object layer that R_OBIS_GetObjectAttr() need to use block transfer
	*block_transfer = 0;

//	 * Temporary if (0) to prevent compile error
//	 * when no class is used
	if (0)
	{
		// Do nothing  
	}
#if (defined(USED_CLASS_01) && USED_CLASS_01 == 1)
//	 * Handle all requests for class 01
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - value : CHOICE
//	 * All other attributes are handled in R_OBIS_DistributeDataClass() function.
	else if (class_id == 1)
	{
		class01_child_record_t	*p_child_record1;

		date_time_t date_time;

		// Get the child record  
		p_child_record1 = (class01_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

