Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
		// Attr 2 - value : CHOICE ?  
		if (attr_id == 2)
		{
			Unsigned8 u8;
			Unsigned16 u16;
			Unsigned32 u32;
//			Unsigned8 buffer[16];
			Unsigned8 buffer[40];
			memset(buffer, 0, 40);
			// Default  
			pbuffer = buffer;

			// Get the size from child table definition  
			size = p_child_record1->value.choice.size;

			// Get the buffer pointer  
			switch (child_id)
			{
				
				case 0:
					
					size =  R_USER_GetNamePlate(NAME_PLATE_LOGICAL_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
						break;
					
				case 1:		// Meter serial number  
					size =  R_USER_GetNamePlate(NAME_PLATE_METER_SERIAL, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 2:		// Manufacture Name  
					size =  R_USER_GetNamePlate(NAME_PLATE_MANUFACT_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 3:		// Firmware Version for meter  
					size =  R_USER_GetNamePlate(NAME_PLATE_FIRMWARE_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 4:		// Meter Type  
					size =  R_USER_GetNamePlate(NAME_PLATE_METER_TYPE, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 5:		// Category  
					size =  R_USER_GetNamePlate(NAME_PLATE_CATEGORY_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 6:		// Current rating  
					size =  R_USER_GetNamePlate(NAME_PLATE_CURRRATE_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 7:		// Meter Year of Manufacture  
					size =  R_USER_GetNamePlate(NAME_PLATE_YEAR_OF_MANUFACT, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;
							
				case 8:		// Demand Integration Period  
					u16 = (Unsigned16)R_USER_GetEMData(DEMAND_INTEGRATION_PERIOD);
					pbuffer = (Unsigned8 *)&u16;
					break;
					
				case 9:		// Profile Capture Period   //NEED TO CHECK // Block load capture period??  
					u16 = (Unsigned16)R_USER_GetEMData(PROFILE_CAPTURE_PERIOD);
					pbuffer = (Unsigned8 *)&u16;
					break;

				case 11:	// Cumulative tamper count  
					u16 = (Unsigned16)R_USER_GetEMData(CUM_TAMPER_CNT);
					pbuffer = (Unsigned8 *)&u16;
					break;

				case 12:	// Cumulative billing count  
					u32 = (Unsigned32)R_USER_GetEMData(CUM_BILLING_CNT);
					pbuffer = (Unsigned8 *)&u32;
					break;

				case 13:	// Cumulative programming count  
					u16 = (Unsigned16)R_USER_GetEMData(CUM_PROGAM_CNT);
					pbuffer = (Unsigned8 *)&u16;
					break;

				case 14:	// EventCode  
				case 15:
				case 16:
				case 17:
				case 18:
				case 19:
					pbuffer = &g_Class01_EventCode[child_id-14];
					break;
				case 20:	// Available Billing Period  
					u8 = (Unsigned8)R_USER_GetEMData(AVL_BILLING_PERIOD);;   //NEED IMPLEMENTATION
					pbuffer = (Unsigned8 *)&u8;
					break;
				case 21:	// No. Of Power Failure  
//					u32 = 10;//(Unsigned32)R_USER_GetEMData(EM_CUCUMLARIVE_BILLING_CNT);
					u32 = (Unsigned32)R_USER_GetEMData(CUM_POWER_FAILURE_COUNT);
					pbuffer = (Unsigned8 *)&u32;
					break;
				case 22:	// Internal CT ratio*  
					u16 =1; //(Unsigned16)R_USER_GetEMData(EM_CUCUMLARIVE_PROGAM_CNT);
					pbuffer = (Unsigned8 *)&u16;
					break;
				case 23:	// Internal VT ratio*  
					u16 = 1;
					pbuffer = (Unsigned8 *)&u16;
					break;
				case 24:	// Phase Sequence  
					if((g_TamperStatus&MISSPOT_MASK)==0)
					{// here no potential is missing
						u16=gPhaseSequence;
					}
					else
					{// here some potential is missing
						u16=255;
					}
					pbuffer = (Unsigned8 *)&u16;
					break;
				case 25:	// Rising Demand kva  
			    u8=60/(int32_t)Common_Data.mdinterval;
					if(myenergydata.kvah>ctldata.kvah_last_saved)
						u16 = ((myenergydata.kvah-ctldata.kvah_last_saved)*(int32_t)u8);
					else
					{
						ctldata.kvah_last_saved=myenergydata.kvah;
						u16=0;
					}
					pbuffer = (Unsigned8 *)&u16;
					break;
				case 26:	// Rising Demand kva elapsed time  
					u16 = rtc.minute - ((rtc.minute/Common_Data.mdinterval)*Common_Data.mdinterval); 
					pbuffer = (Unsigned8 *)&u16;
					break;
					
					
				default:
					break;
			}
			// Determind the size, based on buffer  
			if (pbuffer != NULL &&
				size == -1)
			{
				size = strlen((void*)pbuffer);
			}

			// Encode & indicate as success when buffer is valid  
			if (pbuffer != NULL &&
				size != -1)
			{
				*p_out_len = R_OBIS_EncodeAttribute(
					p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
					OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
					p_child_record1->value.choice.type,		// Type  
					(Unsigned8 *)pbuffer,					// Buffer  
					size									// Length  
				);

				// Success  
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_03) && USED_CLASS_03 == 1)
//	 * Handle all requests for class 03
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - value : CHOICE.
//	 * 2. Attr 3 - scaler_unit : scal_unit_type
//	 * All other attributes are handled in R_OBIS_DistributeRegisterClass() function.
	else if (class_id == 3)
	{
		class03_child_record_t	*p_child_record3;

		// Get the child record  
		p_child_record3 = (class03_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

		// Attr 2 - value : CHOICE ?  
		if (attr_id == 2)
		{
			Integer32 temp32;
			Integer32 tempAnother;
			date_time_t temp_time;
			Unsigned16 u16;
			
			// Get the size from child table definition  
			size = p_child_record3->value.choice.size;

			// Get the buffer pointer  
			switch (child_id)
			{
				case 0:		// Ir  
					temp32 = R_USER_GetEMData(I_R);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 1:		// Iy  
					temp32 = R_USER_GetEMData(I_Y);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 2:		// Ib  
					temp32 = R_USER_GetEMData(I_B);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 3:		// Vr  
					temp32 = R_USER_GetEMData(V_R);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 4:		// Vy  
					temp32 = R_USER_GetEMData(V_Y);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
