Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
				case 5:		// Vb  
					temp32 = R_USER_GetEMData(V_B);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 6:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_R);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 7:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_Y);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 8:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_B);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 9:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_TOTAL);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 10:		// Frequency  
					temp32 = R_USER_GetEMData(FREQUENCY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 11:		// Apparent Power  
					temp32 = R_USER_GetEMData(APPARENT_POWER);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 12:		// Active Power  
					temp32 = R_USER_GetEMData(ACTIVE_POWER);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 13:		// Reactive Power  
					temp32 = R_USER_GetEMData(REACTIVE_POWER);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 14:		// Cumulative Energy - kWh  
					temp32 = R_USER_GetEMData(CUM_ACTIVE_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 15:		// Cumulative Energy - kvarh(lag)  
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LAG_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 16:		// Cumulative Energy - kvarh(lead)  
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LEAD_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 17:		// Cumulative Energy - kVAh  
					temp32 = R_USER_GetEMData(CUM_APPARENT_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 18:		// Cumulative power-failure duration  
// there is another implementation in r_dlms_user_interface.R_USER_GetEMData
// we might as well call that function
					temp32 = R_USER_GetEMData(CUM_POWER_FAILURE_DURN);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 19:		// Billing date  
					temp32 = Common_Data.billing_date;	// this should be a string?
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 20:		// Block Energy kwh  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KWH);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 21:		// Block Energy kvarh lag  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KVARH_LAG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 22:		// Block Energy kvarh lead  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KVARH_LEAD);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 23:		// Block Energy kvah  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KVAH);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 24:		// Power On Duration in Minutes for Current Month  
					temp32 = R_USER_GetEMData(POWER_ON_DURATION);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 25:		// Cumulative Tamper Count
					temp32 = R_USER_GetEMData(CUM_TAMPER_CNT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

#ifdef BIDIR_METER
				case 26:		// Ir - avg 
					temp32 = R_USER_GetEMData(I_R_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 27:		// Iy - avg 
					temp32 = R_USER_GetEMData(I_Y_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 28:		// Ib  - avg
					temp32 = R_USER_GetEMData(I_B_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 29:		// Vr  - avg
					temp32 = R_USER_GetEMData(V_R_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 30:		// Vy  - avg
					temp32 = R_USER_GetEMData(V_Y_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 31:		// Vb  - avg
					temp32 = R_USER_GetEMData(V_B_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 32:		// Cumulative Energy - kWh  Export
					temp32 = R_USER_GetEMData(CUM_ACTIVE_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 33:		// Cumulative Energy - kvarh(lag)  Export  
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LAG_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 34:		// Cumulative Energy - kvarh(lead)   Export
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LEAD_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 35:		// Cumulative Energy - kVAh   Export
					temp32 = R_USER_GetEMData(CUM_APPARENT_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
#endif

#ifdef BIDIR_METER
				case 36:		// high res kwh
#else
				case 26:		// high res kwh
#endif
					temp32 = ((myenergydata.kwh%100000)*100)+(int32_t)high_resolution_kwh_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 37:		// high res kvah
#else
				case 27:		// high res kvah
#endif
					temp32 = ((myenergydata.kvah%100000)*100)+(int32_t)high_resolution_kvah_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 38:		// high res kvarh_lag -38
#else
				case 28:		// high res kvarh_lag -38
#endif
					temp32 = ((myenergydata.kvarh_lag%100000)*100)+(int32_t)high_resolution_kvarh_lag_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 39:		// high res kvarh_lead
#else
				case 29:		// high res kvarh_lead
#endif
					temp32 = ((myenergydata.kvarh_lead%100000)*100)+(int32_t)high_resolution_kvarh_lead_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 40:		// Cumulative Energy - kwh lag
#else
				case 30:		// Cumulative Energy - kwh lag
#endif

	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kwh_lag;
  #else
					temp32 = 0;
	#endif
//					temp32 = 12345678;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 41:		// Cumulative Energy - kwh lead
#else
				case 31:		// Cumulative Energy - kwh lead
#endif
	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kwh_lead;
	#else
					temp32 = 0;
	#endif
//					temp32 = 87654321;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 42:		// Cumulative Energy - kVAh lag
#else
				case 32:		// Cumulative Energy - kVAh lag
#endif
	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kvah_lag;
  #else
					temp32 = 0;
	#endif
	
