Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 43:		// Cumulative Energy - kVAh lead
#else
				case 33:		// Cumulative Energy - kVAh lead
#endif
	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kvah_lead;
  #else
					temp32 = 0;
	#endif
					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				default:
					break;
			}
			// Determind the size, based on buffer  
			if (pbuffer != NULL &&
				size == -1)
			{
				size = strlen((void*)pbuffer);
			}

			// Encode & indicate as success when buffer is valid  
			if (pbuffer !=NULL)
			{
				*p_out_len = R_OBIS_EncodeAttribute(
					p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
					OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
					p_child_record3->value.choice.type,		// Type  
					(Unsigned8 *)pbuffer,					// Buffer  
					size									// Length  
				);

				// Success  
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_04) && USED_CLASS_04 == 1)
//	 * Handle all requests for class 04
//	 * Just do on following attributes only:
//	 * 1. Logical name (OBIS code) of the object.
//	 * 2. Access right definition for 1 object   
//	 * 3  Value                                  
//	 * 4  Scaler, unit                           
//	 * 5  Status                                 
//	 * 6  Capture time buffer                    
//	 * All other attributes are handled in R_OBIS_DistributeRegisterClass() function.
	else if (class_id == 4)
	{
		class04_child_record_t	*p_child_record4;

		// Get the child record  
		p_child_record4 = (class04_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

		// Attr 2 - value : CHOICE ?  
		if (attr_id == 2)
		{
			Unsigned32 temp_f32;
			void *buff = NULL;

			// Get the buffer pointer  
			switch (child_id)
			{
				case 0:		// Maximum Demand  kW  
					temp_f32 = R_USER_GetEMData(EM_ACTIVE_MD);
					buff = &temp_f32;
					break;
					
				case 1:		// Maximum Demand  kVA  
					temp_f32 = R_USER_GetEMData(EM_APPARENT_MD);
					buff = &temp_f32;
					break;

				case 2:		// Maximum Demand  kW - export  
					temp_f32 = R_USER_GetEMData(EM_ACTIVE_MD_EXPORT);
					buff = &temp_f32;
					break;
					
				case 3:		// Maximum Demand  kVA  - export
					temp_f32 = R_USER_GetEMData(EM_APPARENT_MD_EXPORT);
					buff = &temp_f32;
					break;
					
					
				default:
					break;
			}

			// Encode & indicate as success when buffer is valid  
			if (buff !=NULL)
			{
				*p_out_len = R_OBIS_EncodeAttribute(
					p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
					OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
					p_child_record4->value.choice.type,		// Type  
					(Unsigned8 *)buff,						// Buffer  
					p_child_record4->value.choice.size		// Length  
				);

				// Success  
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
		}
		// Attr 5 - capture_time : octet-string  
		if (attr_id == 5)
		{
			date_time_t temp_time;
			switch (child_id)
			{
				case 0:		// Maximum Demand  kW  
					{
						Unsigned8 rlt;
						// Get time  
						rlt = R_USER_GetSpecificTime(LAST_ACTIVE_MD_TIME, &temp_time);
						if (rlt != 0)
						{
							return (response_result);
						}
					}
					break;
				case 1:		// Maximum Demand  kVA  
					{
						Unsigned8 rlt;
						// Get time  
						rlt = R_USER_GetSpecificTime(LAST_APPARENT_MD_TIME, &temp_time);
						if (rlt != 0)
						{
							return (response_result);
						}
						break;
					}
					
//					break;
				default:
					return response_result;
			}
			*p_out_len = R_OBIS_EncodeAttribute(
						p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
						OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
						ATTR_TYPE_OCTET_STRING,					// Type  
						(Unsigned8 *)&temp_time,				// Buffer  
						sizeof(date_time_t)						// Length  
						);
			// Success  
			response_result = DATA_ACCESS_RESULT_SUCCESS;
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_08) && USED_CLASS_08 == 1)
//	 * Handle all requests for class 08
//	 * NOTE: THE CLASS 08 ALLOW ONLY 1 INSTANCE TO BE IMPLEMENTED.
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - time : octet-string.
//	 * 2. Attr 3 - time_zone : long
//	 * 3. Attr 4 - status : unsigned
//	 * 4. Attr 5 - daylight_savings_begin : octet-string
//	 * 5. Attr 6 - daylight_savings_end : octet-string
//	 * 6. Attr 7 - daylight_savings_deviation : integer
//	 * 7. Attr 8 - daylight_savings_enabled : boolean
//	 * 8. Attr 9 - clock_base : enum
//	 * All other attributes are handled in R_OBIS_DistributeClockClass() function.
	else if (class_id == 8)
	{
		// Attr 2 - time : octet-string.  
		if (attr_id == 2)
		{
			date_time_t class8_currenttime;
			Unsigned8 rlt;
			switch (child_id)
			{
				case 0:		// RTC time  
					// Get current time  
					rlt = R_USER_GetSpecificTime(CURRENT_TIME, &class8_currenttime);
					if (rlt != 0)
					{
						return (response_result);
					}

					*p_out_len = R_OBIS_EncodeAttribute(
						p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
						OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
						ATTR_TYPE_OCTET_STRING,					// Type  
						(Unsigned8 *)&class8_currenttime,	// Buffer  
						sizeof(date_time_t)						// Length  
						);

						// Success  
					response_result = DATA_ACCESS_RESULT_SUCCESS;
					break;
				default:
					break;
			}
		}
		else
		{
			// Do nothing  
		}

	}
#endif
	else
	{
		return SCOPE_ACCESS_VIOLATED;
	}

	return (response_result);
}

Unsigned8 R_OBIS_SetObjectAttr(
	st_Cosem_Attr_Desc *cosem_attr_desc,
	service_type_t service_type,
	Unsigned16 child_id,
	Unsigned8 *p_data,
	Unsigned16 data_len,
	Unsigned8 block_transfer
)
{
	// Result of response, def. is not Matched
	Unsigned8 response_result = TYPE_UNMATCH;

	// Vars used to handle processing  
	Unsigned16 class_id;
	Unsigned16 attr_id;

	// Vars used to encode data  
	void        *pbuffer;
	Unsigned16  length;
	Unsigned8	u8_data;
	Unsigned16  u16_data;
	Unsigned32  u32_data;
	Integer32   f32_data;
	attr_type_t type;

			date_time_t user_time;
			date_time_t current_time;
			int8_t match_result;
			Unsigned8 ret;
	
	
	// Params check  
	if (cosem_attr_desc == NULL ||
		p_data == NULL ||
		data_len == 0)
	{
		return TYPE_UNMATCH;
	}

	// Get information from attr descriptor  
	class_id = (
		((Unsigned16)cosem_attr_desc->Class_ID[0] << 8) |
		((Unsigned16)cosem_attr_desc->Class_ID[1])
	);
	attr_id = cosem_attr_desc->Attr_ID;

	if (0)
	{
		// Do nothing  
	}//RC
	#if (defined(USED_CLASS_01) && USED_CLASS_01 == 1)
//	 * Handle all requests for class 01
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - value : CHOICE
//	 *
//	 * All other attributes are handled in R_OBIS_DistributeDataClass() function.

	else if (class_id == 1)
	{
		class01_child_record_t	*p_child_record1;
		// Get the child record  
		p_child_record1 = (class01_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

