Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
	return (response_result);
}

Unsigned8 R_OBIS_E2PRSetData(
	attr_access_t		*p_attr_access,
	attr_type_t 		attr_type,
	Integer16			attr_size,
	Unsigned8			*pdata
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;
//	Unsigned16 decoded_length;
//
//	// Vars used to encode data  
//	Unsigned8       buffer[OBIS_SERVICE_DATA_BUFFER_LENGTH];
//
//	// Params check  
//	if (p_attr_access == NULL ||
//		p_attr_access->method != ACCESS_MTD_E2PR)
//	{
//		return TYPE_UNMATCH;
//	}
//
//	if (attr_type != ATTR_TYPE_ARRAY &&
//		attr_type != ATTR_TYPE_STRUCTURE &&
//		attr_type != ATTR_TYPE_COMPACT_ARRAY)
//	{
//		// Decode attribute  
//		decoded_length = R_OBIS_DecodeAttribute(
//			buffer,									// Output value buffer  
//			p_attr_access->size,					// Size of buffer  
//			attr_type,								// Type  
//			pdata,									// Get from data pointer of HDLC protocol stack  
//			OBIS_SERVICE_DATA_BUFFER_LENGTH			// Encoded length from HDLC  
//		);
//
//		// EEPROM access  
//		// write buffer  
//		if (E2PR_WRITE(p_attr_access->addr, buffer, p_attr_access->size) == E2PR_OK)
//		{
//			// Success  
//			response_result = DATA_ACCESS_RESULT_SUCCESS;
//		}
//		else
//		{
//			response_result = RD_WRT_DENIED;
//		}
//
//
//	}
//	else
//	{
//		// need to call to user distributor ?  
//	}

	return (response_result);
}
#if (defined(USED_CLASS_26) && USED_CLASS_26 == 1)
Unsigned8 R_OBIS_BufferBlockGet(
	void				*buffer,
	attr_access_t		*p_attr_access,
	Unsigned16			block_index,
	Unsigned16			block_size,
	Unsigned8			*p_out_buf,
	Unsigned16			*p_out_len
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;
	Unsigned8			*p_temp_buf;

	// Params check  
	if (p_out_buf == NULL ||
		p_out_len == NULL)
	{
		return response_result;
	}

	*p_out_len = 0;

	if (p_attr_access == NULL)
	{
		if (buffer != NULL)
		{
			p_temp_buf = (Unsigned8 *)buffer;
			p_temp_buf += (block_size * block_index);
			memcpy(p_out_buf, p_temp_buf, block_size);
		}
		else
		{
			return response_result;
		}
	}
	else
	{
		switch (p_attr_access->method)
		{
			case ACCESS_MTD_MEM:
				p_temp_buf = (Unsigned8 *)buffer;
				p_temp_buf += (block_size * block_index);
				memcpy(p_out_buf, p_temp_buf, block_size);
				break;
			case ACCESS_MTD_E2PR:
				if (E2PR_READ(p_attr_access->addr + (block_index * block_size), p_out_buf, block_size) != E2PR_OK)
				{
					return RD_WRT_DENIED;
				}
				break;
			case ACCESS_MTD_USERFUNC:
				// TODO: append code here  
				break;
			default:
				break;
		}
	}

	// Success  
	*p_out_len = block_size;

	return DATA_ACCESS_RESULT_SUCCESS;
}

Unsigned8 R_OBIS_BufferBlockSet(
	void				*buffer,
	attr_access_t		*p_attr_access,
	Unsigned16			block_index,
	Unsigned16			block_size,
	Unsigned8			*p_in_buf,
	Unsigned16			*p_in_len
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;
	Unsigned8 *p_temp_buf;

	// Params check  
	if (p_in_buf == NULL ||
		p_in_len == NULL)
	{
		return response_result;
	}

	*p_in_len = 0;

	if (p_attr_access == NULL)
	{
		if (buffer != NULL)
		{
			p_temp_buf = (Unsigned8 *) buffer;
			p_temp_buf += (block_index * block_size);
			memcpy(p_temp_buf, p_in_buf, block_size);
		}
		else
		{
			return response_result;
		}
	}
	else
	{
		switch (p_attr_access->method)
		{
			case ACCESS_MTD_MEM:
				p_temp_buf = (Unsigned8 *) buffer;
				p_temp_buf += (block_index * block_size);
				memcpy(p_temp_buf, p_in_buf, block_size);
				break;
			case ACCESS_MTD_E2PR:
				if (E2PR_WRITE(p_attr_access->addr + (block_index * block_size), p_in_buf, block_size) != E2PR_OK)
				{
					return RD_WRT_DENIED;
				}
				break;
			case ACCESS_MTD_USERFUNC:
				// TODO: append code here  
				break;
			default:
				break;
		}
	}

	// Success  
	*p_in_len = block_size;

	return DATA_ACCESS_RESULT_SUCCESS;
}
#endif

Unsigned8 R_OBIS_BufferScanByUserFunc (
	buffer_t            *buf,
	Unsigned8           selective_access,
	Unsigned16          master_index,
	Unsigned16          child_index,
	Unsigned8           *p_selector_buffer
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;
	//
//	 * Temporary if (0) to prevent compile error
//	 * when no class is used
	  
	if (0)
	{
		// Do nothing  
	}
#if (defined(USED_CLASS_07) && USED_CLASS_07 == 1)
	else if (master_index == 7)
	{
		response_result = R_OBIS_Class07_BufferScan(
								buf,								// [In] Pointer to buffer_t                       
								selective_access,					// [In] Selective access                          
								child_index,						// [In] Id of the row in child list               
								p_selector_buffer					// [In] Pointer to the selector (from Client)     
							);
	}
#endif
#if (defined(USED_CLASS_26) && USED_CLASS_26 == 1)
	else if (master_index == 26)
	{
		response_result = R_OBIS_Class26_BufferScan(
								buf,								// [In] Pointer to buffer_t                       
								selective_access,					// [In] Selective access                          
								child_index,						// [In] Id of the row in child list               
								p_selector_buffer					// [In] Pointer to the selector (from Client)     
							);
	}
#endif
	else
	{
		// Do nothing  
	}
	return response_result;
}

Unsigned8 R_OBIS_BufferFilterByUserFunc (
	buffer_t            *buf,
	Unsigned16          master_index,
	Unsigned16          child_index,
	Unsigned16          request_entries_nr,
	Unsigned8           *p_out_buf,
	Unsigned16          *p_out_len
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;
//	 * Temporary if (0) to prevent compile error
//	 * when no class is used
	if (0)
	{
		// Do nothing  
	}
#if (defined(USED_CLASS_07) && USED_CLASS_07 == 1)
	else if (master_index == 7)
	{
		response_result = R_OBIS_Class07_BufferFilter(
								buf,								// [In] Pointer to buffer_t                 
								child_index,						// [In] Child ID                            
								request_entries_nr,					// [In] Number of entries need to filter    
								p_out_buf,							// [Out] Data pointer for get               
								p_out_len							// [Out] Data length pointer for get        
							);
	}
#endif
#if (defined(USED_CLASS_26) && USED_CLASS_26 == 1)
	else if (master_index == 26)
	{
		response_result = R_OBIS_Class26_BufferFilter(
								buf,								// [In] Pointer to buffer_t                 
								child_index,						// [In] Child ID                            
								request_entries_nr,					// [In] Number of entries need to filter    
								p_out_buf,							// [Out] Data pointer for get               
								p_out_len							// [Out] Data length pointer for get        
							);
	}
#endif
	else
	{
		// Do nothing  
	}
	return response_result;
}

#if (defined(USED_CLASS_07) && USED_CLASS_07 == 1)
Unsigned8 R_OBIS_Class07_ScanByRange(
	Integer16               restricting_object_id,
	Unsigned16              child_index,
	Unsigned8               *p_selector_buffer
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;

	// Vars to decode selective access selector  
	void        *pbuffer = NULL;
	Unsigned16  i, length;
	Unsigned16  actual_index;
	Unsigned16  decoded_length;
	Unsigned16  current_entry, entries_in_use, max_entries;
	class07_child_record_t  *p_child_record;
	buffer_t                *buf;

	date_time_t from_date_time;
	date_time_t to_date_time;
	uint32_t range_start_entry;
	uint32_t range_end_entry;
	
	
	 // Find OBIS object in child table by visibility, obis code, access right.	  
	p_child_record = (class07_child_record_t *)R_OBIS_FindChildRecordByIndex(7, child_index);

	// Params check  
	if ((restricting_object_id<0)||(restricting_object_id >= *p_child_record->p_capture_obj_length)||(p_selector_buffer== NULL))
		return response_result;

	// Get buffer pointer  
	buf = (buffer_t *)p_child_record->p_buff;

		
// The first step is to extract the from_date_time and to_date_time from the p_selector_buffer
// These are date_time_t structures which are to be copied from p_selector_buffer to 
// from_date_time and to_date_time which happen to be global variables for some reason

	R_USER_WDT_Restart();
	decoded_length = R_OBIS_DecodeAttribute(
		(Unsigned8 *)&from_date_time,			// destination value_buf  
		sizeof(date_time_t),					// destination value_buf_len  
		ATTR_TYPE_DATE_TIME,					// attr_type  
		p_selector_buffer,						// input buffer data stream  
		OBIS_SERVICE_DATA_BUFFER_LENGTH			// buf_len  
	);
	p_selector_buffer += decoded_length;	// move the pointer to next portion of buffer to be read/processed.

	// decode to_date_time  
	decoded_length = R_OBIS_DecodeAttribute(
		(Unsigned8 *)&to_date_time,				// value_buf  
		sizeof(date_time_t),					// value_buf_len  
		ATTR_TYPE_DATE_TIME,					// attr_type  
		p_selector_buffer,						// buf  
		OBIS_SERVICE_DATA_BUFFER_LENGTH			// buf_len  
	);
	p_selector_buffer += decoded_length;	
	
	
// it is required to convert the time range entries into index range entries
// the functions find_num* in the block below should compute the values of range_end_entry and range_start_entry

	if (child_index == 2)	// Block Load Profile
		find_num_between_lp_entries(&from_date_time, &to_date_time, &range_start_entry, &range_end_entry);
//		find_num_between_lp_entries();
		
	else if (child_index == 4)	// Daily Load Profile
		find_num_between_dlp_entries(&from_date_time, &to_date_time, &range_start_entry, &range_end_entry);
//		find_num_between_dlp_entries();

	buf->to_entry   = range_end_entry;//USER
	buf->from_entry = range_start_entry;// USER
	response_result = DATA_ACCESS_RESULT_SUCCESS;

	return response_result;

// The entire following code has been commented - as found
// The commented code was occupying a lot of text space - hence it has been deleted
// It may be referrred to in Copy(5) or earlier - ajayjain
	
