Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
}

Unsigned8 R_OBIS_Class07_BufferScan (
	buffer_t            *buf,
	Unsigned8           selective_access,
	Unsigned16          child_index,
	Unsigned8           *p_selector_buffer
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;

	// Vars value after scan  
	Unsigned16 					i;
	Unsigned16					entries_in_use;
	void 						*pbuffer = NULL;
	class07_child_record_t		*p_child_record;
	Unsigned16					decoded_length;

	// Params check  
	if (buf == NULL)
	{
		return response_result;
	}

//	 * Find OBIS object in child table by
//	 * visibility, obis code, access right.
//
	p_child_record = (class07_child_record_t *)R_OBIS_FindChildRecordByIndex(7, child_index);

	// Get current info of buffer  
	entries_in_use = (Unsigned16)*p_child_record->p_entries_in_use;

	// Default: select all entries, columns
	// the index refers to the number of rows of data available - essentially the number of entries
	// the value index refers to the columns - hence from column to column will allow part of the data to be got
	// this will include the case of getting data for a single column
	buf->from_entry = 1;
	buf->to_entry   = entries_in_use;
	buf->from_value = 1;
	buf->to_value   = *p_child_record->p_capture_obj_length; // All column  

	buf->async_remain_entries   = entries_in_use;

	if (selective_access == 0)
	{
		// select all entries, columns  
		return DATA_ACCESS_RESULT_SUCCESS;
	}
	else if (selective_access == 1)
	{
	// check the access selector  
		if (*(p_selector_buffer) == 0x01)		// by range  
		{
			// Vars to decode data from selector buffer  
			Integer16 restricting_object_id = -1;
//			* Decode the range descriptor
//			*
//			* range_descriptor ::= structure
//			* {
//			*     restricting_object: capture_object_definition
//			*     from_value : CHOICE(string), CHOICE(Integer32) or CHOICE(Integer32)
//			*     from_value : CHOICE(string), CHOICE(Integer32) or CHOICE(Integer32)
//			*     selected_values : array(null)
//			* }

			// Skip the access selector: p_selector_buffer++  
			// Skip ATTR_TYPE_STRUCTURE, Length: p_selector_buffer += 2  
			p_selector_buffer += 3;

			// Decode 4 elements  
			{
//				* 1. restricting_object: capture_object_definition
//				*
//				* capture_object_definition ::= structure
//				* {
//				*     class_id: long-unsigned
//				*     logical_name: octet-string
//				*     attribute_index: integer
//				*     data_index: long-unsigned
//				* }
//
				// Skip ATTR_TYPE_STRUCTURE, Length: p_selector_buffer += 2  
				p_selector_buffer += 2;
				{
//					// 1. Skip class_id (ATTR_TYPE_LONG_UNSIGNED): p_selector_buffer += 3   
//					// 2. Point to logical_name  
//					// Skip ATTR_TYPE_OCTET_STRING, Length: p_selector_buffer += 2  
					p_selector_buffer += 5;

					pbuffer = p_selector_buffer;

//					// Skip logical_name: p_selector_buffer += 6  
//					// 3. Skip attribute_index (ATTR_TYPE_INTEGER): p_selector_buffer += 2  
//					// 4. Skip data_index (ATTR_TYPE_LONG_UNSIGNED): p_selector_buffer += 3  
					p_selector_buffer += 11;
				}

//				* Seach the type which indicated
//				* in capture_object_definition

				for (i = 0; i < *p_child_record->p_capture_obj_length; i++)
				{
					if (R_OBIS_CompareObisCode(
							(Unsigned8 *)pbuffer,
							p_child_record->p_capture_objects[i].logical_name
						) == 1)
					{
						restricting_object_id = (Integer16)i;
						break;
					}
				}

				// when not found, return as not filter any thing  
				if (i >= *p_child_record->p_capture_obj_length)
				{
					buf->from_entry = 0;
					buf->to_entry   = 0;
				}
				else
				{
//					// Filter the entry list based on selected capture object
//					* Decode from_entry, to_entry, from_value, to_value
					response_result = R_OBIS_Class07_ScanByRange(
						restricting_object_id,          // [In] Restricting object id                  
						child_index,                    // [In] Id of the row in child list            
						p_selector_buffer               // [In] Pointer to the selector (from Client)  
					);
				}
			}
		}
		else if (*(p_selector_buffer) == 0x02)	// by entry  
		{
//			* Decode the entry descriptor
//			*
//			* entry_descriptor ::= structure
//			* {
//			*     from_entry : double-long-unsigned
//			*     to_entry : double-long-unsigned
//			*     from_selected_value : long-unsigned
//			*     to_selected_value : long-unsigned
//			* }
			// Skip the access selector: p_selector_buffer++  
			// Skip ATTR_TYPE_STRUCTURE, Length: p_selector_buffer += 2  
			p_selector_buffer += 3;

			// 1. from_entry : double-long-unsigned  
			decoded_length = R_OBIS_DecodeAttribute(
				(Unsigned8 *)&buf->from_entry,				// value_buf  
				4,											// value_buf_len  
				ATTR_TYPE_DOUBLE_LONG_UNSIGNED,				// attr_type  
				p_selector_buffer,							// buf  
				OBIS_SERVICE_DATA_BUFFER_LENGTH				// buf_len  
			);
			p_selector_buffer += decoded_length;

			// 2. to_entry : double-long-unsigned  
			decoded_length = R_OBIS_DecodeAttribute(
				(Unsigned8 *)&buf->to_entry,			// value_buf  
				4,										// value_buf_len  
				ATTR_TYPE_DOUBLE_LONG_UNSIGNED,			// attr_type  
				p_selector_buffer,						// buf  
				OBIS_SERVICE_DATA_BUFFER_LENGTH			// buf_len  
			);
			p_selector_buffer += decoded_length;

			// 3. from_selected_value : long-unsigned  
			decoded_length = R_OBIS_DecodeAttribute(
				(Unsigned8 *)&buf->from_value,			// value_buf  
				2,										// value_buf_len  
				ATTR_TYPE_LONG_UNSIGNED,				// attr_type  
				p_selector_buffer,						// buf  
				OBIS_SERVICE_DATA_BUFFER_LENGTH			// buf_len  
			);
			p_selector_buffer += decoded_length;

			// 4. to_selected_value : long-unsigned  
			decoded_length = R_OBIS_DecodeAttribute(
				(Unsigned8 *)&buf->to_value,			// value_buf  
				2,										// value_buf_len  
				ATTR_TYPE_LONG_UNSIGNED,				// attr_type  
				p_selector_buffer,						// buf  
				OBIS_SERVICE_DATA_BUFFER_LENGTH			// buf_len  
			);
			p_selector_buffer += decoded_length;
		}

//		* exceptions for to_entry
//		* when its value is 0, select to highest
		if (buf->to_entry == 0)
		{
			if(buf->from_entry == 0)
			{
				// exceptions for no entry case  
				buf->async_remain_entries = 0;
				return DATA_ACCESS_RESULT_SUCCESS;
			}
			else
			{
				buf->to_entry = entries_in_use;
			}
		}
//		* exceptions for to_value
//		* when its value is 0, select to highest
		if (buf->to_value == 0)
		{
			buf->to_value = (Unsigned16) *p_child_record->p_capture_obj_length;
		}
		
		if (buf->from_value == 0)
		{
			buf->from_value = 1;
		}

		// Success 
		response_result = DATA_ACCESS_RESULT_SUCCESS;

		if (buf->from_entry == 0 || 
			buf->to_entry < buf->from_entry ||
			buf->from_value == 0 || 
			buf->to_value < buf->from_value)
		{
			// Error  
			return SCOPE_ACCESS_VIOLATED;
		}

		// Calculate Number of entries need to filter  
		buf->async_remain_entries = (Unsigned16)(buf->to_entry - buf->from_entry + 1);
	}

	return response_result;
}

Unsigned8 R_OBIS_Class07_BufferFilter (
	buffer_t            *buf,
	Unsigned16          child_index,
	Unsigned16          request_entries_nr,
	Unsigned8           *p_out_buf,
	Unsigned16          *p_out_len
)
{
	// Vars to access to entry  
	Unsigned16					total_entry;
	Unsigned16					index;
	Integer32					async_index;
	Unsigned16					current_entry, entries_in_use, max_entries, capture_obj_length;
	Unsigned16					length = 0;
	class07_child_record_t		*p_child_record;
	Unsigned8					temp_len;

