Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
//	 * Find OBIS object in child table by
//	 * visibility, obis code, access right.
	p_child_record = (class07_child_record_t *)R_OBIS_FindChildRecordByIndex(7, child_index);

	// Get current info of buffer  
	current_entry          = *buf->p_current_buf_index;
	entries_in_use         = (Unsigned16)*p_child_record->p_entries_in_use;
	max_entries            = (Unsigned16)*p_child_record->p_profile_entries;
	capture_obj_length     = (Unsigned16)*p_child_record->p_capture_obj_length;

	// Start encoding  
	*p_out_len = 0;

	if (request_entries_nr == 0)
	{
		// Null array  
		*p_out_buf++ = ATTR_TYPE_ARRAY;
		*p_out_buf++ = 0;
		*p_out_len   = 2;

		return DATA_ACCESS_RESULT_SUCCESS;
	}

	// Check range  
	if (buf->from_entry > entries_in_use)
	{
		// Over-range: customize HERE, default: return error   
		return TYPE_UNMATCH;
	}
	if (buf->to_entry > entries_in_use)
	{
		// Over-range: customize HERE, select to highest   
		buf->to_entry = entries_in_use;
		buf->async_remain_entries = (Unsigned16)(buf->to_entry - buf->from_entry + 1);
	}

	// Calculate asyn offset for this transfer   
	async_index = buf->to_entry - buf->from_entry + 1; // Max entries  
	async_index -= buf->async_remain_entries;

	if (async_index < 0)
	{
		// Error, need to debug here  
		return TYPE_UNMATCH;
	}

//	* Determine this is first transfer or not ?
//	* by check: async_index == 0 ?
	if (async_index == 0)
	{
		if ((capture_obj_length < buf->to_value) || (capture_obj_length < buf->from_value))
		{
			// Over-range: customize HERE, default: return error   
			return TYPE_UNMATCH;
		}

		// encode the array header  
		*p_out_buf++ = ATTR_TYPE_ARRAY;
		temp_len = BERLengthEncode(p_out_buf, buf->async_remain_entries);
		p_out_buf += temp_len;
		*p_out_len  += temp_len + 1;

		if (child_index == 2)
		{
			// Mark to start async service, pause the capturing  
			R_OBIS_Class07_BlockLoadUpdate_Pause();
		}
		else
		{
			// TODO : start async service for other objects  
		}
	}
//	 * Encode for object of class 07
//	 * Based on following info:
//	 * 1. buf->from_entry,
//	 * 2. buf->to_entry,
//	 * 3. buf->from_value,
//	 * 4. buf->to_value
	// access to the list of selected entries (FIFO)  
	//index  = ((current_entry + max_entries) - entries_in_use) + (Unsigned16)(buf->from_entry + async_index) - 1;
	//index  %= (max_entries);
	

	index  =  (Unsigned16)(buf->from_entry + async_index) - 1;
	
	// Content of array  
	total_entry = request_entries_nr;
	while (total_entry > 0)
	{
		switch(child_index)
		{
			case 0: // Instantaneous parameters snapshot  
			{
				length = R_OBIS_Class07_FilterOneInstEntry(buf, index, p_out_buf, p_out_len);
			}
			break;
			case 2: // Block Load Profile  
			{
				length = R_OBIS_Class07_FilterOneBlockLoadEntry(buf, index, p_out_buf, p_out_len);
			}
			break;
			case 4: // Daily Load Scaler Profile  
			{
				length = R_OBIS_Class07_FilterOneDailyLoadEntry(buf, index, p_out_buf, p_out_len);
			}
			break;
			case 6: // Billing profile  
			{
				length = R_OBIS_Class07_FilterOneBillingEntry(buf, index, p_out_buf, p_out_len);
			}
			break;
			case 9:  // Event 00 profile  
			case 10: // Event 01 profile  
			case 11: // Event 02 profile  
			case 12: // Event 03 profile  
			case 13: // Event 04 profile  
			case 14: // Event 05 profile  
			{
				//length = R_OBIS_Class07_FilterOneEventEntry(buf, index, p_out_buf, p_out_len);
				length = R_OBIS_Class07_FilterOneEventEntry(buf,child_index, index, p_out_buf, p_out_len);
			}
			break;
			case 1: // Instantaneous Scaler Profile  
			case 3: // Block Load Scaler Profile  
			case 5: // Daily Load Scaler Profile  
			case 7: // Billing Scaler Profile  
			case 8: // Event 00 Scaler Profile  
			{
				length = R_OBIS_Class07_FilterOneScalerEntry(buf, index,
											*p_child_record->p_capture_obj_length,
											p_out_buf, p_out_len);
			}
			break;
			case 15: // Name plate profile  
			{
				length = R_OBIS_Class07_FilterOneNamePlateEntry(buf, index, p_out_buf, p_out_len);
			}
			break;
			default:
			{
				// TODO : encode for other objects  
				return TYPE_UNMATCH;
			}
//			break;
		}

		// count down entries counter  
		total_entry--;
		// next entry  
		p_out_buf += length;
		index  = (index + 1) % max_entries;
	}

//	* Determine this is last transfer or not ?
//	* by check: request_entries_nr >= async_remain_entries
	if (request_entries_nr >= buf->async_remain_entries)
	{
		if (child_index == 2)
		{
			// Last transfer, can continue capturing  
			R_OBIS_Class07_BlockLoadUpdate_Start();
		}
		else
		{
			// TODO : start async service for other objects  
		}
	}

	return DATA_ACCESS_RESULT_SUCCESS;
}
#endif // (defined(USED_CLASS_07) && USED_CLASS_07 == 1)  

#if (defined(USED_CLASS_26) && USED_CLASS_26 == 1)
Unsigned8 R_OBIS_Class26_BufferScan (
	buffer_t            *buf,
	Unsigned8           selective_access,
	Unsigned16          child_index,
	Unsigned8           *p_selector_buffer
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;

	// Vars value after scan  
	Unsigned16 					i;
	Unsigned32					offset_value = 0;
	Unsigned16					count_value = 0;
	Unsigned8					len_value = 0;
	Unsigned32					entries_in_use;
	void 						*pbuffer = NULL;
	class26_child_record_t				*p_child_record;
	Unsigned16					decoded_length;

	// Params check  
	if (buf                   == NULL)
	{
		return response_result;
	}

//	 * Find OBIS object in child table by
//	 * visibility, obis code, access right.
	p_child_record = (class26_child_record_t *)R_OBIS_FindChildRecordByIndex(26, child_index);

	// Default: select all entries  
	buf->from_entry = 1;						// Offset  
	buf->to_entry   = *p_child_record->p_len;	// Offset + Count  

	buf->async_remain_entries   = (Unsigned16)*p_child_record->p_len;

	if (selective_access == 0)
	{
		// select all entries, columns  
		return DATA_ACCESS_RESULT_SUCCESS;
	}
	else if (selective_access == 1)
	{
		// check the access selector  
		if (*(p_selector_buffer) == 0x01)		// by offset_access  
		{
//			* Decode the offset_selector descriptor
//			*
//			* offset_selector ::= structure
//			* {
//			*     Offset:  double-long-unsigned
//			*     Count:  long-unsigned
//			* }
			// Skip the access selector  
			p_selector_buffer++;
			// Skip ATTR_TYPE_STRUCTURE, Length  
			p_selector_buffer += 2;
			// 1. Offset:  double-long-unsigned  
			decoded_length = R_OBIS_DecodeAttribute(
				(Unsigned8 *)&offset_value,					// value_buf  
				sizeof(Unsigned32),							// value_buf_len  
				ATTR_TYPE_DOUBLE_LONG_UNSIGNED,				// attr_type  
				p_selector_buffer,							// buf  
				OBIS_SERVICE_DATA_BUFFER_LENGTH				// buf_len  
			);
			p_selector_buffer += decoded_length;

