Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data_old.c
			// 2.  Count:  long-unsigned  
			decoded_length = R_OBIS_DecodeAttribute(
				(Unsigned8 *)&count_value,					// value_buf  
				sizeof(Unsigned16),							// value_buf_len  
				ATTR_TYPE_LONG_UNSIGNED,					// attr_type  
				p_selector_buffer,							// buf  
				OBIS_SERVICE_DATA_BUFFER_LENGTH				// buf_len  
			);
			p_selector_buffer += decoded_length;
		}
		else if (*(p_selector_buffer) == 0x02)	// by index_selector  
		{
//			* Decode the index_selector descriptor
//			*
//			* entry_descriptor ::= structure
//			* {
//			*     Index:  array of long-unsigned
//			*     Count:  long-unsigned
//			* }
			// Skip the access selector  
			p_selector_buffer++;
			// Skip ATTR_TYPE_STRUCTURE, Length  
			p_selector_buffer += 2;
			// 1. Index:  array of long-unsigned  
			// Skip ATTR_TYPE_ARRAY  
			p_selector_buffer ++;
			// Get Length  
			len_value = *p_selector_buffer++;

			for (i = 0; i < len_value; i++)
			{
				offset_value += *p_selector_buffer++;
			}
			// 2. Count:  long-unsigned  
			decoded_length = R_OBIS_DecodeAttribute(
				(Unsigned8 *)&count_value,				// value_buf  
				sizeof(Unsigned32),						// value_buf_len  
				ATTR_TYPE_DOUBLE_LONG_UNSIGNED,			// attr_type  
				p_selector_buffer,						// buf  
				OBIS_SERVICE_DATA_BUFFER_LENGTH			// buf_len  
			);
			p_selector_buffer += decoded_length;
		}
		else
		{
			// Do nothing  
			count_value = 0;
		}

		buf->from_entry = offset_value + 1;						// Offset  
		buf->to_entry   = buf->from_entry + count_value;		// Offset + Count  
	}
	return DATA_ACCESS_RESULT_SUCCESS;
}

Unsigned8 R_OBIS_Class26_BufferFilter (
	buffer_t            *buf,
	Unsigned16          child_index,
	Unsigned16          request_entries_nr,
	Unsigned8           *p_out_buf,
	Unsigned16          *p_out_len
)
{
     // Vars to access to entry  
     Unsigned16                    index, i;
     Integer32                    async_index;
     class26_child_record_t        *p_child_record;
     Unsigned8                    temp_ret;
     Unsigned16                    temp_len;

     //
      * Find OBIS object in child table by
      * visibility, obis code, access right.
       
     p_child_record = (class26_child_record_t *)R_OBIS_FindChildRecordByIndex(26, child_index);

     // Start encoding  
     *p_out_len = 0;

     if (request_entries_nr == 0)
     {
         // Null octect string  
         *p_out_buf++ = ATTR_TYPE_OCTET_STRING;
         *p_out_buf++ = 0;
         *p_out_len   = 2;

         return DATA_ACCESS_RESULT_SUCCESS;
     }

     // Calculate asyn offset for this transfer   
     async_index = (buf->to_entry - buf->from_entry + 1)- buf->async_remain_entries; // Max entries  

     if (async_index < 0)
     {
         // Error, need to debug here  
         return TYPE_UNMATCH;
     }
     else if (async_index == 0)
     {
         // First transfer  
         // encode the octect string header  
         *p_out_buf++ = ATTR_TYPE_OCTET_STRING;
         *p_out_buf++ = (Unsigned8)buf->async_remain_entries;
         *p_out_len  += 2;
     }

     // access to the list of selected entries (FIFO)  
     // index  = buf->from_entry + ((buf->to_entry - buf->from_entry + 1)- buf->async_remain_entries)  
     index  =  (Unsigned16)(buf->to_entry - buf->async_remain_entries + 1);

     // Content of array  
     for (i = 0; i < request_entries_nr; i++)
     {
         temp_ret = R_OBIS_BufferBlockGet(
             p_child_record->p_buff->p_buffer,    	// [In] pointer to buffer list     
             p_child_record->p_buff->p_access,    	// [In] Access method option     
             index,                    				// [In] Block index in buffer     
             1,                    					// [In] Block size in byte  
             p_out_buf,                				// [Out] Data pointer for get     
             &temp_len                				// [Out] length pointer for get     
             );
         if (temp_ret != DATA_ACCESS_RESULT_SUCCESS)
         {
             return temp_ret;
         }
         *p_out_len  += temp_len;
         p_out_buf += temp_len;
         index++;
     }
     // Successful  
     return DATA_ACCESS_RESULT_SUCCESS;
}
#endif // (defined(USED_CLASS_26) && USED_CLASS_26 == 1)  
